CSI API ETABS v1

# cCaseStaticNonlinearStagedSetGeometricNonlinearity Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetGeometricNonlinearity(
    	string Name,
    	int NLGeomType
    )

    Function SetGeometricNonlinearity (
    	Name As String,
    	NLGeomType As Integer
    ) As Integer

    Dim instance As cCaseStaticNonlinearStaged
    Dim Name As String
    Dim NLGeomType As Integer
    Dim returnValue As Integer

    returnValue = instance.SetGeometricNonlinearity(Name,
    	NLGeomType)

    int SetGeometricNonlinearity(
    	String^ Name,
    	int NLGeomType
    )

    abstract SetGeometricNonlinearity :
            Name : string *
            NLGeomType : int -> int

#### Parameters

Name

    Type: SystemString

NLGeomType

    Type: SystemInt32

#### Return Value

Type: Int32

See Also

#### Reference

cCaseStaticNonlinearStaged
Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com